app/views/questions/_answer_comments.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
---
<% @current_answer.responses.each do |response| %>
    <p><%= response.content %> | <em><%= User.find(response.user_id).username %> </em></p>